In [2]:
# Obviously
import pandas as pd
import numpy as np

# Plotting set-up
import matplotlib as mpl
import matplotlib.pyplot as plt
from matplotlib import rc
# Command to reset plot styles to default: mpl.rcParams.update(mpl.rcParamsDefault)
plt.style.use('seaborn-poster')
mpl.rcParams['font.family'] = 'serif'
% matplotlib inline

# Other packages we might need
#! pip install quandl
import quandl

# Options
pd.set_option('display.height', 500)
pd.set_option('display.max_rows', 500)
data_folder = 'data/'

height has been deprecated.

# Helpful list of things to do
* Preprocessing data, exploratory work, feature identification: https://github.com/ShuaiW/ml-cheatsheet
* sklearn examples: https://www.datacamp.com/community/blog/scikit-learn-cheat-sheet

# Things from Excel that I want to be able to do quickly
* See unique values in a data set
* Drop/add columns based on formulas = filter
* Manipulate text strings
* Index match
* Sumif (s)
* Countif (s)
* Map & replace with values from another source
* Reformat datatype
* Pivot tables: http://pbpython.com/pandas-pivot-table-explained.html

# Loading data
1. Load
2. Visualize data, check types
3. Merge data
4. Drop irrelevant columns
5. Split out relevant columns (dictionaries, etc)
6. Add relevant summary columns

In [10]:
listings = pd.read_csv(data_folder + 'listings.csv')
reviews = pd.read_csv(data_folder + 'reviews.csv')
calendar = pd.read_csv(data_folder + 'calendar.csv', parse_dates=True)
neighborhoods = pd.read_csv(data_folder + 'neighbourhoods.csv')

In [11]:
calendar.values

array([[20872145, '2018-09-22', 'f', nan],
       [20872145, '2018-09-21', 'f', nan],
       [20872145, '2018-09-20', 'f', nan],
       ...,
       [19830978, '2017-10-08', 't', '$65.00'],
       [19830978, '2017-10-07', 'f', nan],
       [19830978, '2017-10-06', 'f', nan]], dtype=object)

In [ ]:
# Check the dypes of the headers
listings.dtypes

In [25]:
# Get actual values (also works for series)
listings.values

array([[20872145, 'https://www.airbnb.com/rooms/20872145', 20171005235014,
        ..., 'f', 1, 2.0],
       [13937181, 'https://www.airbnb.com/rooms/13937181', 20171005235014,
        ..., 'f', 1, 1.97],
       [3575220, 'https://www.airbnb.com/rooms/3575220', 20171005235014,
        ..., 'f', 3, 0.45],
       ...,
       [21067520, 'https://www.airbnb.com/rooms/21067520', 20171005235014,
        ..., 'f', 1, 1.0],
       [14287125, 'https://www.airbnb.com/rooms/14287125', 20171005235014,
        ..., 'f', 1, nan],
       [19830978, 'https://www.airbnb.com/rooms/19830978', 20171005235014,
        ..., 'f', 2, 1.58]], dtype=object)

In [27]:
# naive description
listings[0:10].describe()

# can detail which percentiles to include:
# listings[0:10].describe(percentiles=[.05, .25, .75, .95])

# listings.host_acceptance_rate.unique()

,id,scrape_id,host_id,host_acceptance_rate,host_listings_count,host_total_listings_count,neighbourhood_group_cleansed,latitude,longitude,accommodates,...,review_scores_accuracy,review_scores_cleanliness,review_scores_checkin,review_scores_communication,review_scores_location,review_scores_value,license,jurisdiction_names,calculated_host_listings_count,reviews_per_month
count,1.000000e+01,1.000000e+01,1.000000e+01,0.0,10.000000,10.000000,0.0,10.000000,10.000000,10.000000,...,10.000000,10.000000,10.0,10.000000,10.000000,10.000000,0.0,0.0,10.000000,10.0000
mean,1.265288e+07,2.017101e+13,6.220443e+07,NaN,1.900000,1.900000,NaN,42.282457,-71.137379,2.600000,...,9.700000,9.800000,10.0,9.800000,9.000000,9.400000,NaN,NaN,1.900000,1.2380
std,7.664083e+06,0.000000e+00,4.444335e+07,NaN,1.100505,1.100505,NaN,0.005562,0.003272,1.776388,...,0.674949,0.632456,0.0,0.632456,0.471405,0.699206,NaN,NaN,1.100505,0.9048
min,8.494080e+05,2.017101e+13,4.434391e+06,NaN,1.000000,1.000000,NaN,42.274980,-71.144647,1.000000,...,8.000000,8.000000,10.0,8.000000,8.000000,8.000000,NaN,NaN,1.000000,0.4400
25%,6.123628e+06,2.017101e+13,2.070297e+07,NaN,1.000000,1.000000,NaN,42.277577,-71.139121,2.000000,...,10.000000,10.000000,10.0,10.000000,9.000000,9.000000,NaN,NaN,1.000000,0.6625
50%,1.546215e+07,2.017101e+13,6.526445e+07,NaN,1.500000,1.500000,NaN,42.281734,-71.136590,2.000000,...,10.000000,10.000000,10.0,10.000000,9.000000,9.500000,NaN,NaN,1.500000,0.8200
75%,1.800684e+07,2.017101e+13,9.186807e+07,NaN,2.750000,2.750000,NaN,42.287099,-71.135279,2.750000,...,10.000000,10.000000,10.0,10.000000,9.000000,10.000000,NaN,NaN,2.750000,1.8075
max,2.087214e+07,2.017101e+13,1.296400e+08,NaN,4.000000,4.000000,NaN,42.290783,-71.133372,7.000000,...,10.000000,10.000000,10.0,10.000000,10.000000,10.000000,NaN,NaN,4.000000,3.2300

In [7]:
# Rename columns
listings3 = listings.rename(columns={'license':'LICENSE','id':'ID'})

# Replace value in a column with formula

In [ ]:
top_10_brands_en = {'华为':'Huawei', '小米':'Xiaomi', '三星':'Samsung', 'vivo':'vivo', 'OPPO':'OPPO', 
                    '魅族':'Meizu', '酷派':'Coolpad', '乐视':'LeEco', '联想':'Lenovo', 'HTC':'HTC'}

df['phone_brand_en'] = df['phone_brand'].apply(lambda phone_brand: top_10_brands_en[phone_brand] if (phone_brand in top_10_brands_en) else 'Other')

In [ ]:
def get_age_segment(age):
    if age <= 22:
        return '22-'
    elif age <= 26:
        return '23-26'
    elif age <= 28:
        return '27-28'
    elif age <= 32:
        return '29-32'
    elif age <= 38:
        return '33-38'
    else:
        return '39+'

df['age_segment'] = df['age'].apply(lambda age: get_age_segment(age))

# Apply, applymap, and map
* Apply: each series
* Map: each row
* Applymap: each element

In [143]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'), index=['Utah', 'Ohio', 'Texas', 'Oregon'])
frame

               b         d         e
Utah   -1.218925 -1.669478 -0.051027
Ohio   -0.128275 -0.101781  1.096763
Texas  -0.823568 -1.738171  0.160202
Oregon -0.771373  1.342753  1.058894

In [144]:
# Apply: works on each series
f = lambda x: x.max() - x.min()
frame.apply(f)

b    1.090650
d    3.080924
e    1.147790
dtype: float64

In [146]:
# Map: works on each row
frame['e'].map(format)

Utah      -0.05
Ohio       1.10
Texas      0.16
Oregon     1.06
Name: e, dtype: object

In [145]:
# Applymap: element-wise application
format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -1.22  -1.67  -0.05
Ohio    -0.13  -0.10   1.10
Texas   -0.82  -1.74   0.16
Oregon  -0.77   1.34   1.06

# Sumifs, countifs

```
DATE     | EMPLOYEE     | PROJECT | HOURS
02/01/14 | Smith, John  | A001    | 4.0
02/01/14 | Smith, John  | B002    | 4.0
02/01/14 | Doe, Jane    | A001    | 3.0
02/01/14 | Doe, Jane    | C003    | 5.0
02/02/14 | Smith, John  | B002    | 2.0
02/02/14 | Smith, John  | C003    | 6.0
02/02/14 | Doe, Jane    | A001    | 8.0
```

In [ ]:
# To get new table with sum by all projects
df.groupby("PROJECT")["HOURS"].sum()

# To get total for just one project
df.query("PROJECT == 'A001'")["HOURS"].sum()

# If you wanted to count, you could just use .count()

In [96]:
# query examples; these two are equivalent
df.query('a > b')
df[df.a > df.b]

Object `pandas` not found.

```
df
     A    B    C    D     E
0  mitfx  0  200  300  0.25
1     gs  1  150  320  0.35
2    duk  1    5    2  0.45
3    bmo  1  145   65  0.65 
```

In [98]:
# Pivot tables

df = pd.DataFrame({"A": ["foo", "foo", "foo", "foo", "foo",
                         "bar", "bar", "bar", "bar"],
                   "B": ["one", "one", "one", "two", "two",
                         "one", "one", "two", "two"],
                   "C": ["small", "large", "large", "small",
                         "small", "large", "small", "small",
                         "large"],
                   "D": [1, 2, 2, 3, 3, 4, 5, 6, 7]})
df

     A    B      C  D
0  foo  one  small  1
1  foo  one  large  2
2  foo  one  large  2
3  foo  two  small  3
4  foo  two  small  3
5  bar  one  large  4
6  bar  one  small  5
7  bar  two  small  6
8  bar  two  large  7

In [2]:
df.groupby(['A'])['C'].count()

NameError: name 'df' is not defined

# Subsets

In [ ]:
df_subset = df[(df.B == 1) & (df.D > 5)]
df_subset.apply(lambda x: x.C * x.E, axis=1).sum()
# or
print sum(df_subset.C * df_subset.E)

In [97]:
raw_data = {'name': ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'],
        'age': [20, 19, 22, 21],
        'favorite_color': ['blue', 'red', 'yellow', "green"],
        'grade': [88, 92, 95, 70]}

# df = pd.DataFrame(raw_data, index = ['Willard Morris', 'Al Jennings', 'Omar Mullins', 'Spencer McDaniel'])
df = pd.DataFrame(raw_data)
df = df.set_index('name')
df

                  age favorite_color  grade
name
Willard Morris     20           blue     88
Al Jennings        19            red     92
Omar Mullins       22         yellow     95
Spencer McDaniel   21          green     70

Order of operations for working with new data-set:
1. Import data
2. Quick check data

In [36]:
ls data-genomics/

genes.csv*                    gtex_gene_expression.csv*     source.txt                    toxicogenomics_chemicals.csv*

Another convenient operation is map on a series, which performs the operation specified on every element of a column. It's as if you wrote a for-loop to access every item of the GENDER column, and use that item to access the gender dictionary, and replace the value.

In [39]:
gender = {1: 'fillmein',
          2: 'fillmein2'}
subject_phenotypes.GENDER.map(gender)

'fillmein'

In [ ]:
# Code to create a new column called "gender" in `subject_phenotypes` that is the result of using `map` 
# with the `gender` dictionary on the "GENDER" column of `subject_phenotypes`.

In [42]:
s = 'you have as many hours in a day as beyonce'
s.split()
# s.split('d')

['you', 'have', 'as', 'many', 'hours', 'in', 'a', 'day', 'as', 'beyonce']

We can use what we just learned about manipulating strings, on columns of dataframe using `lambda`, which allows us to create small functions. For example, if we wanted to take column `'SUBJID'` from the dataframe `subject_phenotypes`, split every item on the dash character `'-'`, and get the first item, we would do this:

In [ ]:
subject_phenotypes['SUBJID'].map(lambda x: x.split('-')[0])

The above code produces the error,

    <ipython-input-157-6714d86271d7> in <lambda>(x)
    ----> 1 sample_attributes['Tissue Type, more specific detail of tissue type'].map(lambda x: x.split('-')[0])

    AttributeError: 'float' object has no attribute 'split'
    
Which happens because instead of a nice string, there is a `float` there, and `float`s don't know how to be `split`. Why is that? Well, NAs are of type `float`, so this indicates that there's an NA there.

To deal with this, we can add an `if` statement to our `lambda` to make it deal with these situations. We will use the function `isinstance` to check if `x` is a string (the special word for a string in Python is `str`), and replace it with an NA using the `numpy` library (which we imported as `np` for shorthand) `np.nan`.

In [43]:
sample_attributes['Tissue Type, more specific detail of tissue type'].map(lambda x: x.split('-')[0] if isinstance(x, str) else np.nan)

NameError: name 'sample_attributes' is not defined

# Merge

We want to merge these two dataframes on their common column, which is "vegetable" in dataframe1 and crop in dataframe2. We can do this using merge, and specifying what we want to merge the left and right dataframes on.

In [9]:
dataframe1 = pd.DataFrame([['cucumber', 'watery'], ['broccoli', 'crunchy'], ['kale', 'chewy'], 
                           ['mango', 'sweet'] ], columns=['vegetable', 'description'])

dataframe2 = pd.DataFrame([['broccoli', 'harvested', 8], ['broccoli', 'planted', 5],
                           ['kale', 'planted', 6], ['kale', 'harvested', 9],
                           ['cucumber', 'harvested', 7], ['cucumber', 'planted', 4],
                           ['strawberry', 'planted', 10], ['strawberry', 'harvested', 2]], 
                          columns=['crop', 'action', 'number'])

In [10]:
dataframe1

  vegetable description
0  cucumber      watery
1  broccoli     crunchy
2      kale       chewy
3     mango       sweet

In [11]:
dataframe2

         crop     action  number
0    broccoli  harvested       8
1    broccoli    planted       5
2        kale    planted       6
3        kale  harvested       9
4    cucumber  harvested       7
5    cucumber    planted       4
6  strawberry    planted      10
7  strawberry  harvested       2

We want to `merge` these two dataframes on their common column, which is `"vegetable"` in `dataframe1` and `crop` in `dataframe2`. We can do this using `merge`, and specifying what we want to merge the **left** and **right**  dataframes **on**.

In [15]:
# pd.merge(dataframe1, dataframe2, how="outer", left_on='vegetable', right_on='crop').drop(['crop'],axis=1)
pd.merge(dataframe1, dataframe2.rename(columns={'crop':'vegetable'}), how="outer", on='vegetable')

    vegetable description     action  number
0    cucumber      watery  harvested     7.0
1    cucumber      watery    planted     4.0
2    broccoli     crunchy  harvested     8.0
3    broccoli     crunchy    planted     5.0
4        kale       chewy    planted     6.0
5        kale       chewy  harvested     9.0
6       mango       sweet        NaN     NaN
7  strawberry         NaN    planted    10.0
8  strawberry         NaN  harvested     2.0